# 2. Выполнить логические побитовые операции "И", "ИЛИ" и др.
# над числами 5 и 6. Выполнить
# над числом 5 побитовый сдвиг вправо и влево на два знака.


print(5 | 6)
"""
5      |0|0|0|0|0|1|0|1|
6      |0|0|0|0|0|1|1|0|
5 or 6 |0|0|0|0|0|1|1|1|
"""
print(5 & 6)
"""
5       |0|0|0|0|0|1|0|1|
6       |0|0|0|0|0|1|1|0|
5 and 6 |0|0|0|0|0|1|0|0|
"""

print(~ 5)
"""
5    |0|0|0|0|0|1|0|1|
not 5|1|1|1|1|1|0|1|0|
"""

print(5 << 2)
"""
5       |0|0|0|0|0|1|0|1|
5 << 2  |0|0|0|1|0|1|0|0|
"""

print(5 >> 2)
"""
5       |0|0|0|0|0|1|0|1|
5 >> 2  |0|0|0|0|0|0|0|1|
"""